Autodesk.Revit.DB.Sweep.MaxSegmentAngle
The maximum segment angle of the sweep in radians.
Remarks: This property is used to retrieve/set the maximum segment angle of the sweep. It
is settable only when the trajectory segmentation is enabled.

Autodesk.Revit.DB.Sweep.IsTrajectorySegmentationEnabled
The trajectory segmentation option for the sweep.
Remarks: This property is used to retrieve/set the trajectory segmentation state of the sweep.
if return is true, means user can control the MaxSegmentAngle, otherwise is disable.

Autodesk.Revit.DB.Sweep.Path3d
The selected curves used for the sweep path.
Remarks: If the sweep is based on a sketched path, this property is null.

Autodesk.Revit.DB.Sweep.PathSketch
The sketched path for the sweep.
Remarks: If the sweep is based on selected 3d curves, this property is null.

Autodesk.Revit.DB.Sweep.ProfileSymbol
The family symbol profile details for the sweep.
Remarks:  If the profile is not based on a profile family, this property is null.

Autodesk.Revit.DB.Sweep.ProfileSketch
The profile sketch of the sweep.
Remarks: If the profile is not based on sketched curves, this property is null.

Autodesk.Revit.DB.Sweep
A sweep solid or void form.